In [5]:
import pandas as pd 
import numpy as np

In [14]:
dates = np.arange(20200101,20200105)
dates
df1 = pd.DataFrame(np.arange(12).reshape((4,3)), index = dates,columns=['A','B','C'])
df1

          A   B   C
20200101  0   1   2
20200102  3   4   5
20200103  6   7   8
20200104  9  10  11

In [16]:
df2 = pd.DataFrame(df1, index = dates,columns=['A','B','C','D','E'])
df2

          A   B   C   D   E
20200101  0   1   2 NaN NaN
20200102  3   4   5 NaN NaN
20200103  6   7   8 NaN NaN
20200104  9  10  11 NaN NaN

In [18]:
s1= pd.Series([3,4,6],index = dates[:3])
s2 = pd.Series([32,5,3],index=dates[1:])
display(s1,s2)

20200101    3
20200102    4
20200103    6
dtype: int64

20200102    32
20200103     5
20200104     3
dtype: int64

In [19]:
df2['D'] = s1
df2['E'] = s2
df2

          A   B   C    D     E
20200101  0   1   2  3.0   NaN
20200102  3   4   5  4.0  32.0
20200103  6   7   8  6.0   5.0
20200104  9  10  11  NaN   3.0

In [23]:
df2.dropna(axis= 0,how ='any')#去除含有NaN值的行,
 #df2.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

          A  B  C    D     E
20200102  3  4  5  4.0  32.0
20200103  6  7  8  6.0   5.0

In [22]:
df2.dropna(axis =1,)

          A   B   C
20200101  0   1   2
20200102  3   4   5
20200103  6   7   8
20200104  9  10  11

In [24]:
df2.isnull()#查看空值

              A      B      C      D      E
20200101  False  False  False  False   True
20200102  False  False  False  False  False
20200103  False  False  False  False  False
20200104  False  False  False   True  False

In [25]:
df2.fillna(value =0)#填充空值

          A   B   C    D     E
20200101  0   1   2  3.0   0.0
20200102  3   4   5  4.0  32.0
20200103  6   7   8  6.0   5.0
20200104  9  10  11  0.0   3.0

In [26]:
np.any(df2.isnull())any，满足任意条件

True

In [27]:
np.all(df2.isnull())全部满足条件返回T

False